СкладГП/src/Catalogs/Ячейки/Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ячейки</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>НомерВСекторе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКартыСклада</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумРядов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Двухсторонний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЯчейкаОТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШтабеля</name>
    <type>
      <types>EnumRef.vlp_ВидыШтабелейСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

СкладГП/src/InformationRegisters/ОстаткиПакетовНаСкладах/ОстаткиПакетовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПакетовНаСкладах</name>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/Catalogs/Ячейки/Forms/ФормаВыбораШтабеляСектора/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуШтабелей()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ячейки.Ссылка КАК Ссылка,
	|	Ячейки.Наименование КАК Наименование,
	|	ЕСТЬNULL(ВложенныйЗапрос.Пакетов, 0) КАК Пакетов
	|ИЗ
	|	Константа.Склад КАК КонстСклад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ячейки КАК Ячейки
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиПакетовНаСкладах.НомерПакета) КАК Пакетов,
	|				ОстаткиПакетовНаСкладах.Ячейка КАК Ячейка
	|			ИЗ
	|				Константа.Склад КАК КонстантаСклад
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|					ПО КонстантаСклад.Значение = ОстаткиПакетовНаСкладах.Склад
	|			ГДЕ
	|				ОстаткиПакетовНаСкладах.Ряд > 0
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ОстаткиПакетовНаСкладах.Ячейка) КАК ВложенныйЗапрос
	|			ПО Ячейки.Ссылка = ВложенныйЗапрос.Ячейка
	|		ПО КонстСклад.Значение = Ячейки.Владелец
	|ГДЕ
	|	НЕ Ячейки.ЭтоГруппа
	|	И Ячейки.Родитель = &Родитель
	|	И НЕ Ячейки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ячейки.НомерВСекторе,
	|	Наименование";
	Заголовок = "Выбор штабеля сектора "+Параметры.Сектор;
	Запрос.УстановитьПараметр("Родитель", Параметры.Сектор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаШтабелей.Добавить();
		СтрокаТаблицы.Ссылка = Выборка.Ссылка;
		СтрокаТаблицы.Пакетов = Выборка.Пакетов;
		ЭлементФормы = ЯчейкиСклада.ЭлементФормыСекторШтабельКнопка(ЭтотОбъект, Элементы, Неопределено, СтрокаТаблицы.Ссылка, НЕОПРЕДЕЛЕНО, СтрокаТаблицы);
		СтрокаТаблицы.ИмяЭлементаФормы = ЭлементФормы.Имя;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры 

&НаКлиенте
Процедура НачатьВыводКвадратиковНаФормуПослеОткрытия()
	ОпределитьПараметрыРазмещенияЭлементовПриИзмененииПараметровЭкрана();
	НастроитьФорму(ИСТИНА);	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПараметрыРазмещенияЭлементовПриИзмененииПараметровЭкрана()
	ДанныеЭкрана = ПолучитьИнформациюЭкрановКлиента();
	Если ДанныеЭкрана[0].Ширина > ДанныеЭкрана[0].Высота Тогда
		ГоризонтальноеПоложениеЭкрана = Истина;
		ЭлементовПоГоризонтали = 6;	
	Иначе
		ГоризонтальноеПоложениеЭкрана = Ложь;
		ЭлементовПоГоризонтали = 3;
	КонецЕсли;
	ШиринаЭкрана = ДанныеЭкрана[0].Ширина;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОпределитьПараметрыРазмещенияЭлементовПриИзмененииПараметровЭкрана();
	ВывестиЯчейкиШтабелейНаФорму();
КонецПроцедуры 

&НаСервере
Процедура ВывестиЯчейкиШтабелейНаФорму()
	ЯчейкиСклада.НастроитьФормуСектораШтабеляКвадратики(ЭтотОбъект, ТаблицаШтабелей, ИСТИНА);	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(ЗаполнитьТаблицу = ЛОЖЬ)
	Если ЗаполнитьТаблицу Тогда
		ЗаполнитьТаблицуШтабелей()
	КонецЕсли;
	ВывестиЯчейкиШтабелейНаФорму();
КонецПроцедуры

&НаКлиенте
Процедура СекторШтабельНажатие(Элемент, СтандартнаяОбработка)

	СтрокаОписания = ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(Элемент.Имя, ТаблицаШтабелей);	
	
	ЭтаФорма.Закрыть(СтрокаОписания.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(ИмяЭлемента, ТаблицаОписания)
	СтрПакета = ТаблицаОписания.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ИмяЭлемента));
	Если СтрПакета.Количество() = 0 Тогда 
		Возврат Неопределено
	КонецЕсли;
	Возврат СтрПакета[0]
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("НачатьВыводКвадратиковНаФормуПослеОткрытия",0.5, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура СекторШтабельНажатиеКнопки(Команда)
	СтрокаОписания = ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(Команда.Имя, ТаблицаШтабелей);	
	ЭтаФорма.Закрыть(СтрокаОписания.Ссылка);
КонецПроцедуры
